import { Translation } from "./index";

const ar: Translation = {
  header: "مرحبا بكم هناك",
  home: {
    title: "ملعب محفل جورام كرون الشخصي",
    welcome:
      "مرحبًا بك في موقعي الشخصي! اسمي جورام، وأنا أعمل كمهندس برمجيات Front-end (باستخدام React). هنا ستجد نظرة عامة على أعمالي ومهاراتي الحالية. يتطور هذا الموقع باستمرار. أستخدمه كـ 'صندوق رمل رقمي' للتلاعب بالمكونات واكتساب مهارات جديدة في التكنولوجيا. أهدف إلى إضافة أكبر عدد ممكن من التفاصيل والتأثيرات إلى هذا الموقع لعرض مهاراتي الرقمية.",
    interests:
      "كمطور، أحب تصميم المكونات الديناميكية وواجهات المستخدم البديهية التي تدعو المستخدمين إلى النقر واستكشاف. كمعلم سابق لدي جي، رأيت أن بعض الأشخاص يعانون من 'رهبة الأزرار'. إن هذا الموقع يعتبر مكانًا آمنًا للتغلب على ذلك. مثال رائع على ذلك هو صانع الأنماط، وهو تطبيق موسيقي تعليمي يستهدف الأطفال من 8 إلى 10 سنوات. يهدف التطبيق إلى تعليمهم كيفية عمل أنماط الإيقاع. بالإضافة إلى ذلك، هناك قسم يعرض أعمالي لـ Valk Digital، القسم الرقمي لـ Van der Valk.",
    coding:
      "من حيث الشيفرة، أجد السعادة الكبيرة في واجهات المستخدم عالية الاستجابة التي تشعر بالبساطة. لدي أيضًا اهتمام كبير بالرسوم المتحركة وكيف يمكن استخدامها لإثراء تجربة التطبيق. بناءً على مسيرتي السابقة كملحن، أيضًا لدي اهتمام كبير بتصميم الصوت لواجهات المستخدم. بإختصار، كل ما يتعلق بتجربة وتفاعل الشخص مع تكنولوجيا معينة. طموحي الحالي هو الانتقال من كوني قرد الشيفرة إلى غوريلا الشيفرة. في الوقت الحالي، لدي نفس هوسي بالشيفرة الذي كان لديه مع التكوين والإنتاج الموسيقي في الماضي. في نهاية المطاف، أريد أن أكون قادرًا على إنشاء منصات كاملة بنفسي كمطور Full Stack. لدي أيضًا خبرة كبيرة في إنشاء المحتوى وأحب المساهمة في الجانب المفاهيمي. إذا كانت لديك أي أسئلة، لا تتردد في الاتصال بي.",
    usedSoftware: "الأدوات التي أعمل بها:",
  },
  valkDigital: {
    title: "العمل في فالك ديجيتال",
    intro:
      "لقد عملت خلال الـ 18 شهرًا الماضية في فالك ديجيتال، القسم الرقمي في فان دير فالك. نحن مسؤولون عن 5 تطبيقات، بما في ذلك تطبيق فالك إكسكلوسيف الذي يتيح لك حجز الفنادق. فيما يلي لمحة موجزة عن مسؤولياتي:",
  },
  about: {
    title: "حولي",
    intro:
      "من الأصل، أنا موسيقي/ملحن/DJ/رائد ثقافي، حتى آخر أسابيع من إغلاق كورونا في هولندا. في ذلك الوقت، قمت بتحويل مجال عملي لأصبح مطور برامج من خلال دورة التدريب في Codaisseur، ولقد عملت بسرور كبير لمدة 18 شهرًا في Valk Digital، قسم التطبيقات في فنادق Van der Valk. بصفة مستقلة عن البرمجة، هناك مشروعين رصينين آخرين أعمل عليهما سنويًا: مشروع تعليم الموسيقى في نيوفيخين، حيث أكون جزءًا من فرقة باروكية كـ DJ-Producer. وكنت أتعاون كثيرًا مع فنانين من المغرب قبل جائحة كورونا، وأحيانًا ما أتعامل معهم. أستمتع أيضًا بشدة بالاستقرار الذي أحظى به كمطور برامج.",
    besidesCoding: "بجانب البرمجة",
    besidesCodingText:
      "خارج عنصر البرمجة، أستمتع بركوب السكيت. مرة واحدة في السنة، أنضم إلى فريق Bankra Bike Sound System في مهرجان لأدي دور الـ DJ. مع مجموعة من الأصدقاء، أدير حانة في نظام الإسكات الوقائي. كنا نستخدم هذه الحانة في الماضي كاستوديو موسيقي، والآن، حيث أصبحنا جميعًا مطورين برمجيات، نستخدمها كمكان عمل.",
  },
  patternMaker: {
    title: "صانع النمط",
    description: "تم تحسين هذا التطبيق لمتصفح سطح المكتب.",
    usage:
      "مع هذا التطبيق، يمكنك إنشاء نمط إيقاع خاص بك. اضغط على تشغيل لسماع كيف يبدو الإيقاع. أثناء تجوالك، يستمر 'الوقت الموسيقي' في التقدم. بمعنى آخر، لن يتم توقف الموسيقى عند إنشاء إيقاع جديد أو اختيار أصوات مختلفة أو ضبط المنزلقات.",
    stateManagement:
      "تتم معالجة إدارة الحالة باستخدام Redux للإيقاع الحالي والتأثيرات المُعدة مسبقًا واختيارات الأصوات والمنزلقات.",
    howItWorksTitle: "كيف يعمل؟",
    howItWorksContent: [
      "الخلفية هي مُصمم موجة مكتوب بلغة P5، التي تعتمد على فن البرمجة الإبداعية. الموسيقى نفسها تنشأ باستخدام Tone.JS، مكتبة كتبت فوق واجهة برمجة التطبيقات الصوتية على الويب. تضمن استمرار الوقت الموسيقي. الأصوات محفوظة ضمن مجموعة من العينات، التي يمكنك اختيارها باستخدام الزر في الجزء الأعلى الأيسر.",
      "في الجزء الأعلى الأيمن، يمكنك اختيار الإيقاعات المُعدة مسبقًا وحفظ إيقاعك الخاص.",
      "إدارة الحالة تتم باستخدام Redux. هنا يتم حفظ النمط الحالي، بالإضافة إلى الإيقاعات المُعدة مسبقًا الأربعة وحالة التشغيل لنمط الصوت المحدد.",
    ],
    githubLink: "هنا رابط إلى GitHub",
  },

  menu: {
    home: "بيت",
    patternMaker: "صانع الأنماط",
    valkDigital: "Valk Digital",
    about: "عن",
    contact: "اتصال",
    css: "امتحان",
    beatbattle: "يهزم",
  },
};

export default ar;
